{
    "ready": "This event is fired when the FusionCharts library is ready to be used. By the time this event is raised, the browser’s DOM is ready to be interacted with, which corresponds to the DOMContentLoaded event of browsers. In older browsers, where DOMContentLoaded is not fired, the ready event corresponds to the load event of the page. In case the FusionCharts library is included in the page when the DOMContentLoaded event is already fired (i.e. the script is loaded asyncronously using AJAX or by using script deferring methods) the ready event is still fired to ensure integrity of all the listeners.",
    "beforeInitialize": "This pre-initialization event is triggered every time a new instance of the FusionCharts object is created. It then triggers a number of modules that need to be setup on every instance of FusionCharts; the event can be used to perform any actions required to be completed before the initialization of each chart.",
    "initialized": "Triggered when a new instance of the FusionCharts constructor is created.",
    "beforeLinkedItemOpen": "Triggered just before a linked item in a LinkedChart is rendered, after the parent link is clicked. It is triggered before the instance of the drill-down chart is instantiated.",
    "linkedItemOpened": "Triggered when a linked chart is rendered, after the parent link is clicked.",
    "beforeLinkedItemClose": "Triggered just before a linked chart is closed.",
    "linkedItemClosed": "Triggered when a linked chart is closed to go back to its parent chart.",
    "printReadyStateChange": "Used to notify the status of the print manager. Triggered when the print manager starts processing all charts to be printed and again when all charts are ready for managed printing.",
    "dataLoadRequestCompleted": "Triggered when chart data is successfully loaded from a URL (instead of a static JSON or XML file from the system).",
    "dataLoadError": "Triggered if an error is encountered while loading data from the specified URL to the chart object.",
    "dataLoadCancelled": "Triggered when the default behavior of the dataLoadRequested event is cancelled using the eventObj.preventDefault() method. Subsequently, all AJAX requests are aborted.",
    "dataLoadRequestCancelled": "Triggered when the default behavior of the dataLoadRequested event is cancelled by calling the eventObj.preventDefault() method. The event is internally fired if the data source is a local path or the URL fails internal security checks.",
    "dataUpdated": "Triggered when chart data is updated and the chart is redrawn, after the drawComplete event.",
    "dataUpdateCancelled": "Triggered when the default behavior of the beforeDataUpdate event is cancelled by calling the eventObj.preventDefault() method.",
    "dataLoadRequested": "Triggered when chart data is loaded from a URL instead of a static JSON or XML file from the system.",
    "beforeDataUpdate": "Triggered just before chart data is passed to the chart. It is useful if any operations have to be performed on the data before it is applied to the chart.",
    "realTimeUpdateComplete": "Triggered every time a real-time chart completes updating, using the dataStreamURL attribute or through user-interaction (using the edit mode of the real-time angular and linear gauges).",
    "chartCleared": "Triggered when the complete chart canvas is cleared by calling the clearChart() method or by clicking the context menu in real-time charts.",
    "slicingEnd": "Triggered when a pie or a doughnut slice completes slicing out/slicing in.",
    "slicingStart": "Triggered when a pie or a doughnut slice begins slicing out/slicing in.",
    "entityRollOut": "Triggered when the mouse pointer is rolled out from over an entity on a map.",
    "entityRollOver": "Triggered when the mouse pointer is rolled over an entity on a map.",
    "entityClick": "Triggered when an entity on a map is clicked.",
    "connectorRollOver": "This event is applicable to the connector element of the Gantt chart and the maps. It is triggered when the mouse pointer is rolled over a connector connecting the tasks (on a Gantt chart) or the markers (on a map).",
    "connectorRollOut": "This event is applicable to the connector element of the Gantt chart and the maps. It is triggered when the mouse pointer is rolled out from over a connector connecting the tasks (on a Gantt chart) or the markers (on a map).",
    "connectorClick": "This event is applicable to the connector element of the Gantt chart and the maps. It is triggered when a connector connecting the tasks (on a Gantt chart) or the markers (on a map) is clicked.",
    "markerRollOver": "Triggered when the mouse pointer is rolled over a marker on a map.",
    "markerRollOut": "Triggered when the mouse pointer is rolled out from over a marker on a map.",
    "markerClick": "Triggered when a marker on a map is clicked.",
    "pageNavigated": "This event is fired on page change in SSGrid chart.",
    "rotationEnd": "Triggered when a pie/doughnut chart completes rotating.",
    "rotationStart": "Triggered when a pie/doughnut chart starts rotating.",
    "centerLabelRollover": "Triggered every time the mouse pointer is rolled over the center label of the doughnut chart.",
    "centerLabelRollout": "Triggered every time the mouse pointer is rolled out of the center label of the doughnut chart.",
    "centerLabelClick": "Triggered every time the center label of the doughnut chart is clicked.",
    "centerLabelChanged": "Triggered every time the text within the center label of the doughnut chart changes.",
    "chartClick": "Triggered every time a chart is clicked.",
    "chartMouseMove": "Triggered when the mouse pointer is moved over a chart. The event arguments pass useful information related to pointer location, relative to the chart and the page, that can be used for positioning elements like annotations or integrating charts with custom tooltip libraries.",
    "chartRollOver": "Triggered every time the mouse pointer is rolled over a chart.",
    "chartRollOut": "Triggered every time the mouse pointer is rolled out from over a chart.",
    "backgroundLoaded": "Triggered when the background image for a chart (specified using the bgImage attribute) is loaded.",
    "backgroundLoadError": "Triggered when there is an error in loading the background image for a chart (specified using the bgImage attribute).",
    "legendItemClicked": "Triggered when a legend item is clicked.",
    "legendItemRollover": "Triggered when the mouse pointer is rolled over a legend item.",
    "legendItemRollout": "Triggered when the mouse pointer is rolled out from over a legend item.",
    "logoRollover": "Triggered when the mouse pointer is rolled over a logo on a chart.",
    "logoRollout": "Triggered when the mouse pointer is rolled out from over a logo on a chart.",
    "logoClick": "Triggered when the logo on a chart is clicked.",
    "logoLoaded": "Triggered when the logo is loaded on a chart.",
    "logoLoadError": "Triggered when the logo cannot be loaded on a chart because of an error.",
    "beforeExport": "Triggered just before the exporting process of a chart begins, through the export context menu or when the exportChart() method is called programmatically.",
    "exported": "Triggered when a chart exports successfully.",
    "exportCancelled": "Triggered when the default behavior of the beforeExport event is cancelled by calling the eventObj.preventDefault() method.",
    "beforePrint": "Triggered before the printing process for a chart begins, after the print() method is called on the chart.",
    "printComplete": "Triggered when the user confirms or cancels printing through the browser’s print dialog box.",
    "printCancelled": "Triggered when the default behavior of the beforePrint event is cancelled by calling the eventObj.preventDefault() method.",
    "dataLabelClick": "Triggered every time the x-axis label of a data plot is clicked.",
    "dataLabelRollOver": "Triggered when the mouse pointer is rolled over the x-axis label of a data plot.",
    "dataLabelRollOut": "Triggered when the mouse pointer is rolled out from over the x-axis label of a data plot.",
    "scrollStart": "Triggered when you begin scrolling through a chart.",
    "scrollEnd": "Triggered when a chart completes scrolling.",
    "zoomReset": "Triggered every time a zoom line chart is reset to its original values (when the zooming history is cleared).",
    "zoomedOut": "Triggered every time a zoom line chart is zoomed out.",
    "zoomedIn": "Triggered every time a zoom line chart is zoomed in.",
    "zoomed": "Triggered every time a zoom line chart is zoomed in or zoomed out.",
    "zoomModeChanged": "Triggered every time a zoom line chart switches between the pin mode and the zoom mode.",
    "pinned": "Triggered in the pin mode of a zoom-line chart, when the user performs data selection to pin a range.",
    "dataRestored": "Triggered when all data plots on the interactive charts (select-scatter, drag-node, and drag-able charts) are restored to their original values (by clicking the Restore button).",
    "beforeDataSubmit": "Triggered when the Submit button on interactive charts (select-scatter, drag-node, and drag-able charts) is clicked, after the data values are updated by the user.",
    "dataSubmitError": "Triggered when there is an ajax error in sending the POST request with the user-submitted data in interactive charts (select-scatter, drag-node, and dragable charts).",
    "dataSubmitted": "Triggered when the ajax POST request for sending user-submitted data in interactive charts (select-scatter, drag-node, and dragable charts) to the URL is successfully completed.",
    "dataSubmitCancelled": "Triggered when the default behavior of the beforeDataSubmit event is cancelled by calling the eventObj. preventDefault() method.",
    "chartUpdated": "Triggered every time the data on any of the interactive charts (select-scatter, drag-node, and the dragable charts) is updated by user interaction.",
    "nodeAdded": "Triggered when a new node is added to the drag-node chart.",
    "nodeUpdated": "Triggered when a node on the drag-node chart is updated.",
    "nodeDeleted": "Triggered when a node on the drag-node chart is deleted.",
    "connectorAdded": "Triggered when a new connector is added to the drag-node chart.",
    "connectorUpdated": "Triggered when a connector on the drag-node chart is updated.",
    "connectorDeleted": "Triggered when a connector is deleted from the drag-node chart.",
    "labelAdded": "Triggered when a new label is added on the drag-node chart.",
    "labelDeleted": "Triggered when a label is deleted from the drag-node chart.",
    "selectionRemoved": "Triggered when the selection box, drawn on a select-scatter chart, is removed.",
    "selectionStart": "Triggered when you start drawing a selection box on a select-scatter chart.",
    "selectionEnd": "Triggered when you complete drawing a selection box on a select-scatter chart.",
    "labelClick": "Triggered when a label on the drag-node chart is clicked.",
    "labelRollOver": "Triggered when the mouse pointer is rolled over a label on the drag-node chart.",
    "labelRollOut": "Triggered when the mouse pointer is rolled out of a label on the drag-node chart.",
    "labelDragStart": "Triggered when you start dragging a label on the drag-node chart.",
    "labelDragEnd": "Triggered when you finish dragging a label on the drag-node chart.",
    "dataplotDragStart": "Triggered when you start dragging the data plots of the drag-able charts (the drag-node, drag-column, drag-line, and drag-area charts).",
    "dataplotDragEnd": "Triggered when you complete dragging the data plots of the drag-able charts (the drag-node, drag-column, drag-line, and drag-area charts).",
    "processClick": "Triggered when a process in the Gantt chart is clicked.",
    "processRollOver": "Triggered when the mouse pointer is rolled over a process on the Gantt chart.",
    "processRollOut": "Triggered when the mouse pointer is rolled out from over a process on the Gantt chart.",
    "categoryClick": "Triggered when a category on the Gantt chart is clicked.",
    "categoryRollOver": "Triggered when the mouse pointer is rolled over a category on the Gantt chart.",
    "categoryRollOut": "Triggered when the mouse pointer is rolled out of a category on the Gantt chart.",
    "milestoneClick": "Triggered when a milestone on a Gantt chart is clicked.",
    "milestoneRollOver": "Triggered when the mouse pointer is rolled over a milestone on a Gantt chart.",
    "milestoneRollOut": "Triggered when the mouse pointer is rolled out from over a milestone on a Gantt chart.",
    "chartTypeChanged": "Triggered when the chart type is explicitly changed by calling the chartType() method on a chart.",
    "overlayButtonClick": "Triggered when the overlay back button on a linked chart is clicked.",
    "loaded": "Triggered when the chart has finished downloading itself in the client environment. It indicates that the all the resources required to render the chart are ready and that the chart can be drawn. This event can be used to hide any loader components that you might have on your page.",
    "rendered": "Triggered when the chart completes drawing, after the render() method is called. The chart renders if the data provided is correct; otherwise, an error message from the list given here is rendered. A call to this event is made only once, even if new data may be supplied later. It can be used to invoke any further JavaScript methods on the chart or change chart data.",
    "drawComplete": "Triggered when the chart draws for the first time or is redrawn because of a data update, resize, change of chart message, or change of chart type.",
    "renderComplete": "Triggered every time a chart is rendered using the render() method, the chartType() method, or the setChartData() method. It is also triggered every time chart data is successfully updated, which triggers a re-render internally.",
    "dataInvalid": "Triggered when there is no chart data or data with parsing or fetching (from the server) errors is submitted to the chart.",
    "dataXMLInvalid": "Triggered if the chart data (passed to the chart object either by URL or as a string) is not in a usable format.",
    "dataLoaded": "Triggered when the data for a chart (passed by url or as a string) is loaded to the chart object. It ensures that the data passed is valid and the chart can be rendered.",
    "noDataToDisplay": "Triggered when no data is passed to the chart. It can be used to show an error message or take a corrective measure.",
    "legendPointerDragStart": "Triggered when the user starts dragging the legend pointer of a gradient legend, in the heatmap chart and maps.",
    "legendPointerDragStop": "Triggered when the user completes dragging the legend pointer of a gradient legend, in the heatmap chart and maps.",
    "legendRangeUpdated": "Triggered when the range of a gradient legend, in the heat map chart and maps, is updated by dragging the legend pointers.",
    "alertComplete": "Triggered when an alert, notifying the user that a real-time data value has crossed a pre-defined data threshold, is complete.",
    "realTimeUpdateError": "Triggered every time there is an error in updating chart data in real-time, using the dataStreamURL attribute.",
    "dataplotRollOver": "Triggered when the mouse pointer is rolled over a data plot.",
    "dataplotRollOut": "Triggered when the mouse pointer is rolled out from over a data plot.",
    "dataplotClick": "Triggered when a data plot is clicked.",
    "linkClicked": "Triggered when any chart element made clickable, by configuring a link, is clicked.",
    "beforeRender": "Triggered before a chart is to be rendered. Calling the eventObject.preventDefault() method on this event will cancel the rendering process. The rendering process is triggered when the render() method is called on the chart instance.",
    "renderCancelled": "Triggered when the default behavior of the beforeRender event is cancelled using the eventObj.preventDefault() method.",
    "beforeResize": "Triggered before a chart is resized.",
    "resized": "Triggered when a chart is resized either by calling the resizeTo() method or by changing dimensions of the chart container element, when the dimensions are in the percentage format.",
    "resizeCancelled": "Triggered when the eventObj.preventDefault() method is called from within the beforeResize event. This cancels the instructions received from the resizeTo() method.",
    "beforeDispose": "Triggered before a chart is deleted and cleaned from memory.",
    "disposed": "Triggered when a chart is deleted and cleaned from memory.",
    "disposeCancelled": "Triggered when the default behaviour of the beforeDispose event is cancelled using the eventObj.preventDefault() method."
}